app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @posts = Post.all.page(params[:page]).per(10)

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test first blog"], ["body", "Content of first blog"], ["user_id", 1], ["created_at", "2018-01-24 09:49:12.643020"], ["updated_at", "2018-01-24 09:49:12.643020"]]
---
  def create
    @post = current_user.posts.build post_params
    @post.user = current_user

    if @post.save

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
  def update
    if @post.update_attributes post_params

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_post
    @post = Post.find_by id: params[:id]