app/controllers/users_controller.rb

  def update
    if @user.update_attributes edit_user_params
---
UPDATE "users" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "thinh94@gmail.com"], ["encrypted_password", "$2a$11$fBjvQ9vlUYygUQIXvvKhSOQ0Wa12PSG3V71loFkjVQhGoTnlA0jhG"], ["updated_at", "2018-01-24 14:52:31.061402"], ["id", 1]]

  def find_user
    @user = User.find_by id: params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]